totemmaker/TotemArduinoBoards/boards.txt
menu.UploadSpeed=Upload Speed
menu.CPUFreq=CPU Frequency
menu.FlashFreq=Flash Frequency
menu.FlashMode=Flash Mode
menu.FlashSize=Flash Size
menu.PartitionScheme=Partition Scheme
menu.DebugLevel=Core Debug Level
menu.PSRAM=PSRAM
menu.Revision=Board Revision
menu.LORAWAN_REGION=LoRaWan Region
menu.LoRaWanDebugLevel=LoRaWan Debug Level

##############################################################

roboboardx4.name=RoboBoard X4
roboboardx4.vid.0=0x10c4
roboboardx4.pid.0=0xea60

roboboardx4.upload.tool=esptool_py
roboboardx4.upload.speed=921600
roboboardx4.upload.maximum_size=1310720
roboboardx4.upload.maximum_data_size=327680
roboboardx4.upload.flags=
roboboardx4.upload.extra_flags=

roboboardx4.serial.disableDTR=true
roboboardx4.serial.disableRTS=true

roboboardx4.build.tarch=xtensa
roboboardx4.build.bootloader_addr=0x1000
roboboardx4.build.target=esp32
roboboardx4.build.mcu=esp32
roboboardx4.build.core=esp32
roboboardx4.build.variant=roboboard_x4
roboboardx4.build.board=ROBOBOARD_X4

roboboardx4.build.f_cpu=240000000L
roboboardx4.build.flash_size=8MB
roboboardx4.build.flash_freq=40m
roboboardx4.build.flash_mode=dio
roboboardx4.build.boot=dio
roboboardx4.build.partitions=default_8MB
roboboardx4.build.defines=
roboboardx4.build.loop_core=
roboboardx4.build.event_core=
